var default_tags = {
    '背景': {
        name: '背景'
    },

    '时代': {
        parent: '背景',
    },

    '1960s': {
        parent: '时代',
    },

    '地区': {
        parent: '背景',
    },

    '景气': {
        parent: '背景',
    },

    '社会阶层': {
        parent: '背景',
    },

    '社会结构': {
        parent: '背景',
    },

    '角色': {
        name: '角色'
    },

    '性别': {
        parent: '角色',
    },

    '姓名': {
        parent: '角色',
    },
    '年龄': {
        parent: '角色',
    },
    '职业': {
        parent: '角色',
    },
    '技能': {
        parent: '角色',
    },
    '社会地位': {
        parent: '角色',
    },
    '社交状况': {
        parent: '角色',
    },
    '资产状况': {
        parent: '角色',
    },
    '发展趋势': {
        parent: '角色',
    },
    '环境': {
        name: '环境',
    },
    '时刻': {
        parent: '环境',
    },
    '位置': {
        parent: '环境',
    },
    '社会地位': {
        parent: '环境',
    },
    '心理活动': {
        name: '心理活动'
    },
    '情绪': {
        parent: '心理活动'
    },
    '稳定性': {
        parent: '心理活动'
    },

    '动作': {
        name: '动作'
    },

    '色情动作': {
        parent: '动作'
    },

    '挑逗': {
        parent: '色情动作'
    },
    '爱抚': {
        parent: '色情动作'
    },
    '侍奉': {
        parent: '色情动作'
    },
    '性交': {
        parent: '色情动作'
    },
    '肛交': {
        parent: '色情动作'
    },
    '调教': {
        parent: '色情动作'
    },
    '调情': {
        parent: '色情动作'
    },
    '射精后': {
        parent: '色情动作'
    },

    
    '概念': {
        name: '概念'
    },


};