
var contents = '   ！一吞一吐，妙趣横生……\n\
\n\
    突然她含了口热水，将我肉棒再次含入，龟头被烫得奇爽无比，她的小嘴将我肉棒套弄几下后又将它吐出，接着含了口凉水，龟头再次享受至高的的待遇，我没想到路静也会玩冰火两重天，当她再次含入热水时，我知道我的忍耐力逃不过她这一口，高速套弄，肉棒已急剧膨胀，路静感到我的肉棒正粗暴的顶着她的咽喉，我在她的口中向里紧顶时突然精门一松，我阳精趁此时全部射入路静的嘴里。\n\
\n\
    路静粹然不防之下，不知所措地将热水和我全部精液吞入口中。\n\
\n\
    口交后路静执意要出去，可我却坚持要看一眼她的神圣私人花园，开始她坚决反对，在我一再要求下，温柔的她羞涩地点了头。\n\
\n\
    “只准看，不可以用手再摸，更不可以用嘴舔。”路静又下了命令。\n\
\n\
    我当然表示同意，路静温顺地躺倒在沙发上，轻轻分开玉腿。\n\
\n\
    我跪在她身前，将她的双腿搁在我的双肩上，然后将她没有穿内裤的裙子轻轻掀起，迷人之处顿时显露出来，我闻了一下，还有一股淡淡的清香。\n\
\n\
    和我想象的一样，路静的确拥有一只万人迷的包子穴，在那令人遐想的桃源洞口，花房高隆，娇香可溢，黑浓的茵茵芳草覆盖其上，罩着神秘幽谷，整个赤贝粉红清幽，一条诱人小溪穿越小丘向后延伸，把这高挺唇肉一分为二；鲜红闪亮的嫩穴在芳草底下若隐若现，门户重叠，玉润珠圆，轻张微合，娇媚无比！\n\
\n\
    香臀浑圆，玉腿修长，纤臂似藕，腰细如折柳！\n\
\n\
    在路静桃源圣地的周围是一大片荫毛，长得很茂密，饱满的阴阜微微裂开一条细缝。\n\
\n\
    宝蛤已然潺潺流水，两片嫩红的小荫唇静静守护着小穴，等待着主人的到来。\n\
\n\
    “路静，你的蜜洞真美，能碰一下上面的相思豆吗？”\n\
\n\
    “不行。”她再次反对。\n\
\n\
    我真的不敢轻举妄为，见我在她面前如此温顺，路静爽朗地笑了，她把她的手指放在娇嫩花瓣上，向左右分开成v字型，她花蕾还是粉红色的，连边缘都呈现粉嫩粉嫩，发出鲜明的粉红色泽，荫道皱纹层层叠叠遮蔽住销魂洞穴。\n\
\n\
    “你不是想知道我是不是处女吗？把脸凑近啊。”我大喜，将她的玉腿分到最开，脸凑近了她的蜜洞，从缝隙看到红色的粘膜，那是还没有让任何东西碰过的处女粘膜。\n\
\n\
    “我是处女吗？”\n\
\n\
    “是处女。”我异常兴奋，也顾不上刚才的保证，一口向她的嫩穴吻去，可是路静比我更迅速，我的嘴唇刚吸到她的荫唇，舌头只舔了一下她的荫道口，还没来得及伸进荫道，她就已把双腿从我肩上放下，从沙发上一跃而起。\n\
\n\
    “看够了就出去吧，飞飞还在唱歌呢。”\n\
\n\
    这次我没有再强留她，只是说：“路静你的内裤呢？”路静白了我一眼，说：“内裤早上在公车上被你射得全是精液，当然被我放在包里。”\n\
\n\
    “路静，将内裤给我留个纪念吧，每晚睡觉前都会吻它的，那上面有你的淫水呢。”我哀求说。\n\
\n\
    “讨厌。”路静大方地将内裤赠送给我，我们热吻了一下后就走出了影院小间，回到了大包厢。\n\
\n\
    欢迎访问龙腾小说网请记住收藏！屠龙阁 (www.tulongge.com )\n\
\n\
    正文 第四十二章 挑衅\n\
\n\
    更新时间：2014-08-29 01:57:03 字数：17384\n\
\n\
    我和路静出来后，却看到路飞飞已经坐在包厢里，一边喝着水果酒，一边用遥控器选着歌单，看来她是已经学会怎么操作练歌房里的这些设备了，那个包厢公主也已经出去了。\n\
\n\
    你唱什么歌啊？我问她。小姑娘哼哼叽叽了几句，在音乐的声音下，我都没有听清楚，出声又问了一遍，路飞飞却拿起话筒，对着我清唱了一句：“你到底有几个好妹妹……”\n\
\n\
    路静的脸顿时就红了，我更是不知所措地僵在那里，我和路静都以为，这个小女孩知道了我们的事情，没想到路飞飞却哈哈大笑起来，抱着话筒又唱道：“看不穿，是你失落的魂魄，猜不透，是你瞳孔的颜色，一阵风，一场梦，爱如生命般莫测，你的心到底被什么蛊惑……”\n\
\n\
    我听出来了，这是赵薇版的画皮的主题曲，小姑娘嗓音清脆甜润，唱得还很有几分味道。\n\
\n\
    我和路静都同时松了一口气，以为刚才路飞飞是在随意地开玩笑，只是我们却没有注意到，这首歌的歌词含义！\n\
\n\
    坐了会儿，路静刚才被我玩到了几次高潮，又帮着我口交了半天，她实在是累了，就靠在沙发上默默地睡着了，我出去找包厢公主要了一床毛毯，盖在路静身上，然后我也懒洋洋地坐在那里，看小丫头有一句没一句地瞎哼哼。\n\
\n\
    可能是觉得我一直在看着她，路飞飞唱着唱着，突然就停下来，然后掉过头来，用她亮闪闪的大眼睛狠狠地瞪着我，用不怕不怕那首歌的调子对着话筒唱：“看见色狼，我不怕不怕啦，我神经比较大，不怕不怕不怕啦……”\n\
\n\
    我被她逗得哈哈大笑，路飞飞生气地丢下了话筒，对着我说：“你笑什么笑，说你呢，大色狼！”\n\
\n\
    我说我怎么了啊，又招惹你了？路飞飞小心地看了一眼睡着的路静，然后恶狠狠地问我：“你刚才和我姐在里面做什么啦？”\n\
\n\
    我吓了一跳，心惊胆战地问：“你看见了？”路飞飞的小脸上红了起来，拿起几枚干果就丢我，小声骂道：“你这色狼，真是无耻，还说不喜欢我姐，你居然要她帮你做……做……那种事……”\n\
\n\
    我急忙说：“小声点啊，祖宗，你不知道你姐脸很浅的啊，要是被她晓得了，肯定会抓狂的！”\n\
\n\
    “你知道害怕，干嘛还那么不要脸？”小丫头凶巴巴地瞪着我，声音也放得小小的，看样子也怕吵醒她姐。\n\
\n\
    我皮着脸说：“我有什么好害怕的啊，我又很有很没道德心地跑去偷窥别人！”\n\
\n\
    小丫头顿时就怒了，用手上的干果篮披头盖脸地向我砸来，我被她扔得到处跑，直接就躲进了那个造星现场里面。\n\
\n\
    “出来啊，你有种出来啊！”路飞飞叉着腰站在小隔间门口，漂亮的小脸对着我很嚣张地说道。\n\
\n\
    我隔着雕花玻璃看到她那副得意洋洋的样子，实在觉得很好笑，就在门里学她的语气：“进来啊，你有种进来啊！”\n\
\n\
    小丫头一听，直接就伸脚踢门，我怕玻璃门踢破把她脚伤着，连忙躲开，路飞飞洋洋得意地走了进来，小手上还拈着几枚美国蛇果，很嚣张地说道：“小子，我就进来了，你怎么的？”\n\
\n\
    我干笑：“你进来你就有种了嘛，这不是我们说好了的嘛！”看到小丫头脸上变了颜色，我才想起来，“有种”这句话在女人来说，好像是骂人的！\n\
\n\
    路飞飞一枚蛇果就向我扔了过来，砸在我身上感觉好痛，蛇果差不多就跟小苹果一样大小了，砸身上跟那些无花果之类的干果，那是不可同日而言！\n\
\n\
    我已经有点生气了，谁知道这个小丫头居然还没轻没重地继续把剩下的蛇果往我身上砸，边砸还边唠叨：“叫你耍流氓！叫你当色狼！叫你欺负我姐！”\n\
\n\
    “别扔了啊，再扔我揍人了啊！”我大声喝斥起来！\n\
\n\
    小丫头又两个蛇果砸了过来：“你这流氓还有理了。哼！你动动我试试？”说完还很不屑地看着我！\n\
\n\
    我刚好被这两只蛇果砸到了头上，痛得眼泪都快流出来了，又看到路飞飞挑衅的目光，我怒不可遏，扑上就拉她的脚，嘴里同时怒道：“试试就试试！”路飞飞看我真动手，吓得丢开蛇果哇哇乱叫，两腿还乱踢不想让我控制住。可她哪敌得过我？两只脚都被我捉住，身子被扭着双腿翻成背朝上，拉拽中还露出了里面的白色小内裤，急得她已带出了哭腔在哇哇尖叫，两条修长玉腿乱蹬乱踢。\n\
\n\
    我把她拽到沙发边，只用右手就把她的两只脚都捉住，左手则用力掐摁住她的细腰，牢牢地把她摁在沙发边。然后松开她的双脚，侧开些身子防她踢中，也不理会她的内裤露在外边，抡掌向她的屁股噼啪噼啪揍去，嘴里还发泄着怨气：“你以为你是公主？还动动你试试，试了又怎么样，你咬我看看啊？”\n\
\n\
    路飞飞屈辱地哭骂挣扎着，骂得还挺难听，这更激怒了我，下手更重。我打着骂着，这小丫头还真倔犟，打到我手都麻了路飞飞还不肯求饶，而且哭骂的话更加难听，这令我恶从胆边生，双目变得赤红，“噌——”猛然一把扯下她的内裤，露出已被打得发红的两瓣圆臀，抡掌更响亮地击打上去。\n\
\n\
    这青春少女的浑圆美臀趴着还又高又翘，也如路静的丰臀一样弹性十足，击打上去的手感好极了，我打得好过瘾。可忽然感觉从扯下她的内裤那刻起，居然不再听到她尖叫怒骂，也不再挣扎，一声不吭一动不动像个死人，这把我一下吓出了一身冷汗，极慌乱地想她不会是羞得气死了吧？我吓傻似的不知所措。\n\
\n\
    我痴傻了仅片刻，就忙去扳路飞飞的头，怕她真的气死过去。可没等我扳，路飞飞自己却掉过了头，居然寒着挂有泪痕的脸，极冷静地问我：“打呀？怎么不打了？还想怎么打？是不是让我都脱光了你再打？今天我就让你满意，让你打死算啦！”\n\
\n\
    路飞飞不仅是嘴说，边说边坐起身面对我极快地从头上脱下了裙子t恤，一双散发寒气的眼睛死死盯我，又把乳罩扯拽脱下，然后挺起扣着两团饱满白嫩像小玉球的乳房，寒光迸射的美目挑衅地看着我，看我尴尬难堪的样子，嘴角还露出嘲笑意味。\n\
\n\
    这过程发生的极快，造星现场小间里出现了诡异的情形，沙发边站着一个痴愣的呆小子，沙发上坐着一位光着玲珑娇嫩身躯怒目而视的美少女。路飞飞的举动真把我一下弄蒙了，傻愣片刻后听着这赌气的话，看着这一脸轻蔑的神色和赤裸裸的娇美肉体，我何能对这样的路飞飞再下手？只有选择落荒而逃。\n\
\n\
    路飞飞得势不罢休，对着我的背影嚷道：“你敢跑出去，我就叫醒我姐！”\n\
\n\
    我都冲到了门口，却被小丫头这话吓得僵住了，站在门口呐呐说：“那个……飞飞……我们是闹着玩的……”\n\
\n\
    光着身子的路飞飞得意地走到我面前，看到我慌张的样子，那狼狈样竟逗得她爆出一串咯咯娇笑。可等笑完后，路飞飞揉着两瓣还疼的屁股，刚才她身体产生的一股莫名快意此时达到高潮，不由地佝偻下身子加紧了双腿，兴奋变形的俏脸通红的好似发着高烧，眼里透出更复杂的神色直勾勾地盯着我。\n\
\n\
    我吓了一跳，连忙抱住小丫头：“你怎么样了？”我心想坏了坏了，这小丫头不会是有心脏病，已经被我气得发作了吧？\n\
\n\
    看着她通红的脸，我连忙把她抱起来，放在小间里的双人沙发上，她挣扎起来，我说你不舒服先躺下不要动，我去给你叫医生！然后转身就要走，她突然说我要是敢出去，她就去死！\n\
\n\
    我呆在那里苦笑说你要干什么啊？她冷哼着说应该是我问你要干什么才对，你刚才对我姐干什么了？\n\
\n\
    我说我和你姐的事，你小孩子不懂的！她坐起来怒道：“我还是小孩子吗？”我看着那玲珑有致的雪白身体，一阵口干舌燥地说你快穿上衣服！\n\
\n\
    路飞飞冷冷说：“你还没见过没穿衣服的女人吗？少在我面前装清纯了，你是个什么东西我早就看清楚了！”\n\
\n\
    我生气了，瞪着她说我是什么东西啊？她不屑地说你是什么东西你自己还不清楚，那天就敢在商厦里偷窥女生换衣服，今天又强迫我姐跟你做下流事情！你以为你是什么好东西！\n\
\n\
    我心头大怒，听到这个小女生把我说得如此不堪，是个男人都会有三分火气的，我伸手就向她胸部摸去，她本能的一下抓住我的手说你干什么？我冷笑说你不是说我是色狼吗？我就色给你看啊！路飞飞的胸部坚挺结实，充满了少女的柔嫩和弹性，我本来只是在气头上真的耍流氓的，但握着她手感极佳的乳房，我的头竟然真的晕乎乎起来了。\n\
\n\
    我俯身吻住她的嘴巴，她呜咽几下就配合张开了小嘴！我的手又去摸她的荫部，她又紧抓我的手不放开，我说，怎么怕了？她听到我的挑衅，竟然松开了手，冷冷地说有本事你就强jian我！不然就滚出去！\n\
\n\
    我心头火冒三丈，把手伸到她的小荫部中间肉缝上磨蹭起来！我的鸡芭早已硬的象铁棍似的，我边吻边摸抠女孩子最敏感的地区！感觉到有黏粘的东西流出！我悄悄脱下了自已裤子，问她说。这可是你叫我强jian的？\n\
\n\
    她冷笑说有本事你就来啊？我把她的双腿分开，这时才看到她那长的象馒头似的小荫部上面只有十几根绒毛，两片隆起的微红的肉片紧紧包在一起，我用拇指和食指扒开她的两瓣唇片，用食指轻揉她的阴di，她闭着眼睛不说话，也许是刺激太强红红的小洞很快就流出了白色的透明密液，我把早已硬的红的烫手鸡芭放在她荫道上磨蹭起来，我拿她手来拿我鸡芭，她死活不拿。\n\
\n\
    我扒开她的小荫道口就向里插，刚进去了一个龟头她就疼得闷哼了一声，小手都捏成了拳头，我感觉很挤，但是由于水很多却又很滑，我便慢慢抽插一点一点挤压，终于全军没入。路飞飞终于哭了，她说你拿出来啊好疼好胀的！而此时我的鸡芭被她幼暖的小荫道包裹得舒服无比，主要是根部感觉最爽，这会我哪舍得把鸡芭拿出来！\n\
\n\
    我不理她继续抽插起来，路飞飞就一直喃喃自语说：好了吗！你拿出来吧！我好疼……求你了！拿出来吧，等这些没用的话！此时我加快了速度，并用嘴舔她的乳头咬她的小乳房，我感觉她的荫道真的很紧就象是手握的感觉！美不能言！因为她娇小所以每次到底都感觉龟头撞到了什么！\n\
\n\
    而她除了胀疼，求我不要！终于快到了顶峰，我用双手使劲掰住了她的双肩，鸡芭加快撞击！看着她两瓣唇片跟着我的鸡芭一进一出，情欲高胀，在我发出一阵低吼中射了精，射了鸡芭也不软，拨出鸡芭看到她小荫部被撞击的一片红肿、从那还是那紧合肉缝里流出红白相间的液体！\n\
\n\
    路飞飞一直哭一直骂，说我不是人，竟然真的敢强jian她，看着她楚楚可怜的神情，我没来就没有软的鸡芭硬得更痛了，我就把她按在沙发上，脚站在地面上，粗硬的鸡芭又向的她的肉缝中插去，把龟头夹在她的小肉缝中来回摩擦着，享受着她的幼嫩荫道给我带来的快感，路飞飞虽然很紧张，但很快又被挑逗得流出水来，水很多，我将她的荫唇分开，同时用手弄她的大荫唇内壁，将胀大了的阴核露出来，并以手指轻轻地按摩着那她的小豆豆。\n\
\n\
    我的那根大肉棒，此时就像怒马似的，高高的翘着赤红的龟头，筋暴露。我用手扶着鸡芭，大龟头在荫唇边拨弄了一阵后，已感到她的淫水愈流愈多，自己的大龟头已整个润湿了，沾满了黏滑的淫液。我轻轻地将龟头前端移到荫道口，下身向上挺起，令龟头缓缓地抵着荫道口。\n\
\n\
    这时我整个人已俯在她的身上，一只手支撑着床，用一只手握住粗大棒棒，当龟头渐渐没入两片荫唇时，她说了声：疼。我把屁股向后动了动，然后往前一用力，滋！的一声，我巨大的龟头推开柔软的荫唇挤入了紧小的荫道口。我觉得龟头被挤压着粗大的肉棒充塞了她的每个空隙，。她忍不住一声娇叫，羞红着脸不断地喘息着。我将她双腿提起，压向胸脯，腰用力一挺！\n\
\n\
    路飞飞“哦”了一声，我的大鸡芭已连根尽没在她的荫道里！我使劲对着她的小bi大起大落地抽插，每次都把荫茎拉到荫道口，再一下插进去，阴囊打在她的屁股上，啪啪直响。她不停说着不，不……喘息越来越重，每一声呻叫都伴随着长长的出气，脸上的肉随着紧一下，仿佛是痛苦，又仿佛是舒服。\n\
\n\
    我只感觉到她荫道一阵阵的收缩，每插到深处，就感觉有一只小嘴要把龟头含住一样，一股股淫水随着荫茎的拔出顺着屁股沟流到了床单上，已湿了一片。我坚硬的大龟头不停地撞击着她的子宫，她的荫道口两片薄薄的嫩唇裹着荫茎，随着抽插被拖出带入，她大概几乎要失去知觉，张开嘴，下颌微微颤抖，不停的发出呻吟声。小乳房不停的抖动着。我的大鸡芭在那一张一合的小bi里愈抽愈急，愈插愈猛，一下比一下深、一下比一下重地插她的肉嫩的小bi，不时传来性器交合的“啪啪…”声她将双腿和阴阜尽量打开挺起，我的鸡芭尽量插入内阴深处，我的耻骨紧紧地挤压着她的阴阜和阴核，龟头顿时变得无比的坚硬。\n\
\n\
    路飞飞下身不断的紧缩着，两条腿都紧紧的盘着我的腰，我再也忍受不住，感觉到粗大的棒棒开始猛烈的抽搐，跟着荫茎跳了几跳，一股滚烫热麻的精液直往她的子宫射去，连续七八下，直到她整个荫道都灌满我的精液，我畅快地舒了一口长气，用耻骨抵着她的阴阜不愿分离，直到她用力推我，我才退了出来，一股淫水将刚射出的新鲜热辣精液挤出洞口……\n\
\n\
    在练歌房强jian这种极品美少女的刺激实在是太大了，我即使射了两次，鸡芭却是越胀越痛，好像欲炎没有消散反而是更强烈了！\n\
\n\
    根本没有给路飞飞喘息的机会，我又去摸她，她全身僵直的挺了起来，苍白着脸朝沙发里面躲开，看样子是真的被我操得怕了，我不客气的从后面把手指在她的私处抠弄，由于连做了两次，路飞飞的荫道口全是淫水和精液，摸上去非常的滑，小丫头只是挣扎，没有喊。我在她耳边悄声说，你不是说我没本事吗？你有本事躲个什么啊……\n\
\n\
    她听这话，真的不躲了，我把她压在身下，我用鸡芭慢慢在她荫部上摩擦一只手抚摸她柔嫩的小乳房，我尽兴地玩弄一会16岁少女的娇乳嫩蕾，然后用鸡芭开始戳弄少女的苞缝儿，龟头在柔细滑嫩的肉缝儿上磨弄着，借着龟头上的黏液，和她荫道里分泌的水我一使劲，肉棒无情地再次顶进了这个小姑娘幼嫩的肉缝。窄紧的肉缝被撑开了。\n\
\n\
    我屁股抬了抬，将鸡芭抽出半截，我的肉棒又被染红，小丫头路飞飞的荫道内粉红色的嫩肉被带着翻了出来。她低哼了一声，我腰向前一挺，肉棒再次插了进去，比刚才还深，她大概有点疼，身子动了动。我的鸡芭在路飞飞的荫道里进进出出，但动一动她就跟着轻声哼哼，路飞飞的荫道好有弹性，还有一种温热的感觉，我稍一用力鸡芭就滑进更深了。非常光滑暖和的小洞，下面鸡芭硬的快把石头戳通了。\n\
\n\
    我边操边用中指向下探索她的小缝上的小肉珠。路飞飞的身子一震……我用手指轻揉她那个勃起的小阴di，小丫头浑身止不住的颤动，我抽出了鸡芭跪在她的双腿之间，再将她浑圆结实的屁股抱起来分开，她的整个荫部都露了出来。\n\
\n\
    我再次将鸡芭对在路飞飞身体中间。用手撑着身子将鸡芭慢慢插到她的两腿之间荫道里，虽然刚才插进去了一半，但是还是不敢太用力猛烈插进去怕撕裂她的荫部，毕竞她还是个少女，她双手支在沙发上，帮着分担一部分体重。我将火热的龟头顶在那光滑的小肉洞口上浅浅地抽插，不一会儿她小荫道里就流出了更多的淫水出来。\n\
\n\
    感觉很刺激，做了几下我就顶住不了，调整了一下角度大鸡芭的头顺利的顶进她两腿之间的缝里了，由于这次水多了，做起来舒服多了，我开始一点一点的抽动，她两腿之间皮肤很嫩，加上我流出水水的润滑，虽然有些涩涩的感觉但是还是不错的，我就用整条鸡芭在她的小荫道里快速抽动起来，抽了几下我觉得不过瘾，就将身子调整了一下，向她里面顶；可能是有水的缘故，我感到小弟弟进入了两片软肉中间，很暖和，好像对前面龟头刺激的很大，有些麻麻的感觉，象小蚂蚁在爬我又抽动了几下，就让小弟弟在她的两片肉之间来回的滑动，这种感觉舒服极了，我的小腹和她滑嫩的小腹贴在一起。\n\
\n\
    水越流越多，我动作越来越大，每次我稍微用力一些，路飞飞就闷哼一声！快感愈来愈多！我有点失去控制，而身下的小丫头，这时候竟还会发出低低的哼哼。我凶猛地在路飞飞小洞和肉缝中抽送摩擦……我的心跳越来越快，我快控制不住了～～我的鸡芭紧紧的顶在那个小洞中，用力地向里面插，虽然我已膨胀到了极点，但还是控制自己，而没有粗暴的狠狠地插……小洞真的很紧，像个很紧的箍套在我的前面头的龟头上，我用力地向里钻，我感觉到我马上就要射了，身下的大鸡芭也随着我的动作，暴胀酥麻……天哪……我要～～我控制不住了……\n\
\n\
    我感觉到大鸡芭开始涨跳了起来。我用力地向里面顶，就想深点——再深点——我感觉鸡芭很麻了，而路飞飞的身子也突然的乱动，我赶紧用两手托住路飞飞嫩滑的小屁股蛋儿，路飞飞的身体一下抽搐起来，她的下面一下子变得很有力，用力的夹腿，荫道里也本能夹紧我的鸡芭，我的龟头开始涨跳喷射……她扭动的动作越来越大。我依然紧紧地压着她，向里面发射。我想最少喷跳了有二十下，直 ';

// should make paragraph here

var highlighted_tag = 'label-primary';
var section_start = '<p class="section">';
var section_end = '</p>';
var words = $('#words');
var tags = $('#tags');
var page_tags = $('#page_tags');
var section_tags = $('#section_tags');

var section = function () {
    this.tags = [];
    this.inited = false;
};

var selected_section;
var preselected_section;


$.get('/notes/analyze_words', { content: note.origin_content }, function (res) {
    var result = res.result;

    $('#page_tags').html(render_tags(result));

});

sections.forEach(function (_section) {
    var node = section_start + section_end;

    var $node = $(node).appendTo(words);
    var current_section =  $node[0].section = new section();
    current_section.node = $node;

    $.get('/notes/tokenize_words', { content: _section.content }, function (res) {
        var result = res.result;
        $node.html(render_tokens_for_section(result));
    });
    $.get('/notes/analyze_words', { content: _section.content }, function (res) {
        var result = res.result;
        current_section.tags = result;
        current_section.inited = true;
    });

})

var render_tags = function (tags) {
    return tags.map(function (word) {
        return '<span class="tag label label-default">' + word + "</span>";
    }).join(' ');
};

var render_tokens_for_section = function (tokens) {
    return tokens.map(function (word) {
        if (word[0] == ' ') {
            return '&nbsp;';
        }
        return '<span class="word" data-word="' + word[0] + '">' + word[0] + "</span>";
    }).join('');
};

var render_tokens = function (tokens) {


    return section_start +
        tokens.map(function (word) {
            if (word[0] == ' ') {
                return '&nbsp;';
            }
            if (word[0] == '\n') {
                return section_end + section_start;
            }
            return '<span class="word" data-word="' + word[0] + '">' + word[0] + "</span>";
        }).join('') +
        section_end;
};

$("#words")
    .on('click', '.section', function (e) {
        var current_section = this.section = this.section || new section();
        if (current_section == selected_section) {
            return;
        } else if (selected_section) {
            selected_section.node.find('.' + highlighted_tag).removeClass(highlighted_tag);
        }

        selected_section = current_section;
        $(this).addClass('current_section').siblings().removeClass('current_section');

        selected_section.offsetTop = $(this).offset().top;

        if (current_section.inited) {
            section_tags.html(render_tags(current_section.tags));
            place_section_tags();
        }
    });


// for each paragraph need a tags
// and auto abstract tags
// tags need edit
// click tag need highlight



section_tags
    .on('mouseover', '.tag', function () {
        var $this = $(this);
        if ($this.is('.' + highlighted_tag)) {
            return;
        }
        var text = $this.text();
        $this.addClass(highlighted_tag).siblings().removeClass(highlighted_tag);
        selected_section.node.find('.' + highlighted_tag).removeClass(highlighted_tag);
        selected_section.node.find('[data-word="' + text + '"]').addClass(highlighted_tag);
    });

var place_section_tags = function () {
    if (!selected_section) {
        return;
    }

    var scrollTop = document.body.scrollTop;
    var clientHeight = document.documentElement.clientHeight;
    var section_tags_height = section_tags.height();
    var section_tags_offset_top = section_tags.offset().top;
    var tags_height = tags.height();

    section_tags.css({
        top: Math.max(Math.min(selected_section.offsetTop - scrollTop - 50 - tags_height + section_tags_height, clientHeight - section_tags_height - tags_height), 0)
    });
}

$(document).on('scroll', place_section_tags);
$(window).on('resize', place_section_tags);
/**
 * 这里随便写一点自动生成的思路
 * 
 * 不管那种自动生成都需要先做特征工程，所以tag是必须的
 * 
 * tag分为多种层级
 * 
 *   大纲级别的  开始/经过/高潮/结局
 *   内容的简述 描述的内容 先分为
 * 
 *  角色背景
 *  外貌描写
 *  环境描写
 *  心里活动描写
 *  动作描写
 *  互动描写
 * 
 *   然后目标是短篇小黄文，选择特征词基于搜索的算法来生成，然后人工修改一下。
 *   素材库需要手工标记。然后这个东西就作为标记工具来使用。
 * 
 * 
 */

